## Pandas Basics

In [12]:
import numpy as np
import pandas as pd

In [13]:
labels = ['a','b','c']
data1 = [10,20,30]
arr = np.array(data1)
dict1 = {'a':10,'b':20,'c':30}

## Series

In [14]:
pd.Series(data = data1)

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(data = data1, index = labels)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(data1,labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [18]:
pd.Series(dict1)

a    10
b    20
c    30
dtype: int64

## Pandas Series can hold any object

In [20]:
pd.Series(data=[sum,print,str,len])

0      <built-in function sum>
1    <built-in function print>
2                <class 'str'>
3      <built-in function len>
dtype: object

In [22]:
ser1 = pd.Series([1,2,3,4],['India','Germany','USA','Canada'])
ser1

India      1
Germany    2
USA        3
Canada     4
dtype: int64

In [23]:
ser2 = pd.Series([1,2,5,4],['Italy','France','Denmark','UK'])
ser2

Italy      1
France     2
Denmark    5
UK         4
dtype: int64

In [24]:
ser1['India']

1

## Operation on Series

In [26]:
ser3 = pd.Series([1,2,5,4],['Germany','India','USA','Canada'])
ser3

Germany    1
India      2
USA        5
Canada     4
dtype: int64

In [25]:
#If there is no matching series than it will retun Null Value
ser1 + ser2

Canada    NaN
Denmark   NaN
France    NaN
Germany   NaN
India     NaN
Italy     NaN
UK        NaN
USA       NaN
dtype: float64

In [31]:
#Sequence does not matter
ser1+ser3

Canada     8
Germany    3
India      3
USA        8
dtype: int64

## DataFrames

In [33]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [37]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['P','Q','R','S'])

In [38]:
df

          P         Q         R         S
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [39]:
#Each column of a DataFrame is of type Series 
df['P']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: P, dtype: float64

In [46]:
type(df['P'])

pandas.core.series.Series

### Another Way of getting column values

In [52]:
df.P

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: P, dtype: float64

### If you return more than one column than it will be a DataFrame

In [57]:
df[['P','Q']]

          P         Q
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [58]:
type(df[['P','Q']])

pandas.core.frame.DataFrame

### Adding a new column

In [59]:
df['new'] = df['P']+df['Q']

In [60]:
df

          P         Q         R         S       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

### Dropping a column

In [62]:
#Column - Axis is 1
df.drop('new',axis=1)

          P         Q         R         S
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [63]:
df

          P         Q         R         S       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

### inplace operation - To permanently apply the operation

In [64]:
df.drop('new',axis=1,inplace=True)

In [65]:
df

          P         Q         R         S
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Dropping rows

In [66]:
#By Default axis is 0; i.e. Rows
df.drop('A')

          P         Q         R         S
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Fetching location/labelled based Index

In [67]:
df.loc['B']

P   -0.134841
Q    0.390528
R    0.166905
S    0.184502
Name: B, dtype: float64

In [73]:
df.loc[['A','B'],['P','Q']]

          P         Q
A  0.302665  1.693723
B -0.134841  0.390528

### Fetching numerical based Index

In [69]:
df.iloc[0]

P    0.302665
Q    1.693723
R   -1.706086
S   -1.159119
Name: A, dtype: float64

In [74]:
df.iloc[[0,1],[1,2]]

          Q         R
A  1.693723 -1.706086
B  0.390528  0.166905

### Boolean operations

In [78]:
df[df['P']>0]

          P         Q         R         S
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [85]:
bool1 = df['P']>0
bool1

A     True
B    False
C     True
D    False
E    False
Name: P, dtype: bool

In [86]:
df[bool1]

          P         Q         R         S
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [88]:
df[df['P']>0][['Q','R']]

          Q         R
A  1.693723 -1.706086
C  0.072960  0.638787

In [92]:
#Redoing above steps in multiple easy steps
cond1 = df['P']>0
out1 = df[cond1]
col1 = ['Q','R']
out1[col1]

          Q         R
A  1.693723 -1.706086
C  0.072960  0.638787

### Multiple conditions in DataFrame

In [93]:
True & False

False

In [96]:
True > False

True

In [98]:
True == False

False

In [103]:
df[(df['P']>0) & (df['Q']<1)]

          P        Q         R         S
C  0.807706  0.07296  0.638787  0.329646

In [115]:
#OR operation
df[(df['P']>1) | (df['Q']<1)]

          P         Q         R         S
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

### reset index

In [121]:
df1 = df.copy()

In [126]:
df1.reset_index(inplace=True)

In [133]:
# index A,B,C.. becomes a column now 
df1

  index         P         Q         R         S
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

### Make column as Index

In [134]:
newindex = 'CA WY CO TX NY'.split()

In [135]:
newindex

['CA', 'WY', 'CO', 'TX', 'NY']

In [136]:
df['states'] = newindex

In [144]:
df

               P         Q         R         S
states
CA      0.302665  1.693723 -1.706086 -1.159119
WY     -0.134841  0.390528  0.166905  0.184502
CO      0.807706  0.072960  0.638787  0.329646
TX     -0.497104 -0.754070 -0.943406  0.484752
NY     -0.116773  1.901755  0.238127  1.996652

In [156]:
df.set_index('states',inplace = True)

In [174]:
df

        level_0  index         P         Q         R         S
states
CA            0      0  0.302665  1.693723 -1.706086 -1.159119
WY            1      1 -0.134841  0.390528  0.166905  0.184502
CO            2      2  0.807706  0.072960  0.638787  0.329646
TX            3      3 -0.497104 -0.754070 -0.943406  0.484752
NY            4      4 -0.116773  1.901755  0.238127  1.996652

### drop columns from dataframe

In [177]:
df.drop(columns=['level_0', 'index'], inplace=True)

In [178]:
df

               P         Q         R         S
states
CA      0.302665  1.693723 -1.706086 -1.159119
WY     -0.134841  0.390528  0.166905  0.184502
CO      0.807706  0.072960  0.638787  0.329646
TX     -0.497104 -0.754070 -0.943406  0.484752
NY     -0.116773  1.901755  0.238127  1.996652

### Index Levels

In [213]:
out = ['A1','A1','A1','A2','A2']
out

['A1', 'A1', 'A1', 'A2', 'A2']

In [214]:
inside = [1,2,3,1,2]
inside

[1, 2, 3, 1, 2]

In [215]:
hier_ind = list(zip(out,inside))
hier_ind

[('A1', 1), ('A1', 2), ('A1', 3), ('A2', 1), ('A2', 2)]

In [216]:
hier_index = pd.MultiIndex.from_tuples(hier_ind)
hier_index

MultiIndex([('A1', 1),
            ('A1', 2),
            ('A1', 3),
            ('A2', 1),
            ('A2', 2)],
           )

In [217]:
df = pd.DataFrame(randn(5,2),hier_index,['A','B'])
df

             A         B
A1 1 -0.804652  0.253548
   2  0.649148  0.358941
   3 -1.080471  0.902398
A2 1  0.161781  0.833029
   2  0.975720 -0.388239

#### Naming Index levels

In [218]:
df.index.names

FrozenList([None, None])

In [219]:
df.index.names = ['Groups','No']

In [220]:
df

                  A         B
Groups No
A1     1  -0.804652  0.253548
       2   0.649148  0.358941
       3  -1.080471  0.902398
A2     1   0.161781  0.833029
       2   0.975720 -0.388239

#### Fetching value by location

In [221]:
df.loc['A1']

           A         B
No
1  -0.804652  0.253548
2   0.649148  0.358941
3  -1.080471  0.902398

In [222]:
df.loc['A1'].loc[1]

A   -0.804652
B    0.253548
Name: 1, dtype: float64

In [223]:
df.loc['A2'].loc[2]['B']

-0.38823869993016363

#### Cross sectional data

In [226]:
df

                  A         B
Groups No
A1     1  -0.804652  0.253548
       2   0.649148  0.358941
       3  -1.080471  0.902398
A2     1   0.161781  0.833029
       2   0.975720 -0.388239

In [227]:
df.xs(1,level='No')

               A         B
Groups
A1     -0.804652  0.253548
A2      0.161781  0.833029